In [14]:
import pandas as pd

In [15]:
import numpy as np

In [16]:
titanic_data = pd.read_csv('D:/Evarcity/R-Programming/titanic.csv')

In [17]:
titanic_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [18]:
titanic_data.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [19]:
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [20]:
## Percentage of missing values
titanic_data.isnull().sum()/len(titanic_data)*100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [21]:
## Filling missing values 'Age'
m1 = titanic_data.Age.mean()

In [22]:
##filling missing values in 'Age' column
titanic_data['Age'] = titanic_data.Age.fillna(m1)

In [23]:
## Checking the table of Embarked column

titanic_data.Embarked.value_counts().idxmax()

'S'

In [24]:
##fillin missing values in EMbarked column

titanic_data['Embarked'] = titanic_data.Embarked.fillna('S')

In [25]:
titanic_data.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked       False
dtype: bool

In [26]:
titanic = titanic_data.drop(['PassengerId','Cabin','Name','Ticket','Fare'], axis = 1)

In [27]:
titanic.dtypes

Survived      int64
Pclass        int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Embarked     object
dtype: object

In [28]:
## Step1: get all indepedent vatriable as 'x'

x = titanic.drop('Survived', axis=1)

In [29]:
## Step2: get depedent variable as 'y'
y = titanic['Survived']

In [30]:
## Step 3: non numeric column to numeric using 'one_hot_encoding' or 'Lable encoder'

x = pd.get_dummies(x, dtype ='int')

In [31]:
x.head(10)

,Pclass,Age,SibSp,Parch,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,3,22.000000,1,0,0,1,0,0,1
1,1,38.000000,1,0,1,0,1,0,0
2,3,26.000000,0,0,1,0,0,0,1
3,1,35.000000,1,0,1,0,0,0,1
4,3,35.000000,0,0,0,1,0,0,1
5,3,29.699118,0,0,0,1,0,1,0
6,1,54.000000,0,0,0,1,0,0,1
7,3,2.000000,3,1,0,1,0,0,1
8,3,27.000000,0,2,1,0,0,0,1
9,2,14.000000,1,0,1,0,1,0,0

In [32]:
x.dtypes

Pclass          int64
Age           float64
SibSp           int64
Parch           int64
Sex_female      int32
Sex_male        int32
Embarked_C      int32
Embarked_Q      int32
Embarked_S      int32
dtype: object

In [33]:
## Step4: if depedent variable is non numeric then convert it into numeric without one_hot_encoding

In [34]:
## Step5: Divide the datainto train_test set
from sklearn.model_selection import train_test_split

In [35]:
xtrain,xtest,ytrain,ytest = train_test_split(x,y,test_size=0.20)

In [36]:
## Step6: Develop logistic regression model

from sklearn.linear_model import LogisticRegression
model = LogisticRegression()

In [37]:
## Step7: fit the model between xtrain and ytrain
model.fit(xtrain, ytrain)

C:\Users\Rajz\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [38]:
## Step8: Apply to model into xtest set

predicted_sales = model.predict(xtest)

In [41]:
#### Validation to xtest and ytest using confusion matrix
import sklearn.metrics as metrics
confusion_matrix = metrics.confusion_matrix(ytest, predicted_sales)  
print(confusion_matrix)

[[89 20]
 [20 50]]

In [ ]:
## Calculate Precison

from sklearn.metrics import precision_score
precision = precision_score(ytest, predicted_sales)
print(precision)

In [ ]:
## Calcualte Recall/Sensitivity

from sklearn.metrics import recall_score
recall_score = recall_score(ytest, predicted_sales, average = 'binary')
print(recall_score)

In [ ]:
## Calculate F1_Score

from sklearn.metrics import f1_score
f1_score = f1_score(ytest, predicted_sales)
print(f1_score)